//CARRECMJ    JOB CV2,,REGION=0M,NOTIFY=&SYSUID
//*
//* COBOL CICS COMPILE JOB (CARREC V2 - MAP USE)
//*
//CICSPROG   EXEC DFHZITCL                       IBM CICS COMPILE PROC
//COBOL.SYSIN  DD DISP=SHR,DSN=&SYSUID..CBL(CARRECM)  MY COBOL PROGRAM
//COBOL.SYSLIB DD DISP=SHR,DSN=&SYSUID..COPYLIB           MY COPYBOOKS
//LKED.SYSLMOD DD DISP=SHR,DSN=&SYSUID..CICS.PROD.DFHLOAD   MY LOADLIB
//LKED.SYSIN   DD *,SYMBOLS=EXECSYS
  NAME CARRECM(R)
/*
