//CARRECJ     JOB CV1,,REGION=0M,NOTIFY=&SYSUID
//*
//* COBOL CICS COMPILE JOB (CARREC V1 - DATASTREAM)
//*
//CICSPROG   EXEC DFHZITCL                       IBM CICS COMPILE PROC
//COBOL.SYSIN  DD DISP=SHR,DSN=&SYSUID..CBL(CARREC)   MY COBOL PROGRAM
//LKED.SYSLMOD DD DISP=SHR,DSN=&SYSUID..CICS.PROD.DFHLOAD   MY LOADLIB
//LKED.SYSIN   DD *,SYMBOLS=EXECSYS
  NAME CARREC(R)
/*
