//DB2BIND JOB
//         EXPORT SYMLIST=(SSID,PROGRAM)
//         SET SSID=DBCG
//         SET PROGRAM=COBSQL
//DSNTSO   EXEC PGM=IKJEFT01,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=ZXP.PUBLIC.LOAD
//         DD DISP=SHR,DSN=DSNC10.SDSNLOAD
//         DD DISP=SHR,DSN=DSNC10.SDSNLOD2
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *,SYMBOLS=EXECSYS
DSN SYSTEM(&SSID.)
BIND PACKAGE (&SYSUID.) LIB('&SYSUID..DBRMLIB') MEMBER(&PROGRAM.)
BIND PLAN(&SYSUID.) PKLIST(&SYSUID..*)
END
/*
