//IDCAMSJ  JOB ID1,NOTIFY=&SYSUID
//*
//* UTILITY JCL FOR IDCAMS  -- GREG, TRY THIS JCL TO DELETE YOUR
//*                                  UNWANTED VSAM FILE.-
//*                         (THEN BURN IT:)
//STEP1   EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *,SYMBOLS=CNVTSYS
  DELETE &SYSUID..COMPLETE
/*
//*SYSIN     DD *,SYMBOLS=CNVTSYS
//* LISTCAT ENTRIES(&SYSUID..PSVS.EREGUSR)
//* PRINT INDATASET(&SYSUID..PSVS.EREGUSR)
//*
