//JCL1     JOB
//COPYJCL2 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSUT1   DD DISP=SHR,DSN=ZXP.PUBLIC.JCL(JCL2)
//SYSUT2   DD DISP=SHR,DSN=&SYSUID..JCL(JCL2)
//*
//COPYJCL3 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSUT1   DD DISP=SHR,DSN=ZXP.PUBLIC.JCL(JCL3)
//SYSUT2   DD DISP=SHR,DSN=&SYSUID..JCL(JCL3)
