//CICS4ZXP JOB FB3,NOTIFY=&SYSUID
//*
// EXPORT SYMLIST=(*)
// SET CARD='//'
//*
//STARTCXZ EXEC PGM=IEBGENER
//SYSPRINT DD DUMMY
//SYSIN    DD DUMMY
//SYSUT2   DD SYSOUT=(*,INTRDR)
//SYSUT1   DD *,SYMBOLS=CNVTSYS
&CARD.CX&SYSUID JOB CICS4ZXP,CLASS=(C4Z)
&CARD.C4Z EXEC PROC=CICS4ZXP,TSOUID=&SYSUID
/*
