//SMPLIST  JOB 1,NOTIFY=&SYSUID
//DEL      EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=CNVTSYS
  DELETE &SYSUID..SMPLIST
  SET MAXCC=0
//LIST     EXEC SMPPROC
//SMP.SMPLIST DD DSN=&SYSUID..SMPLIST,DISP=(,CATLG),
// SPACE=(CYL,(1,1)),UNIT=SYSDA
//SMPCNTL  DD  *
  SET    BDY(MVST).
  LIST   SYSMOD(UJ93472).
  LIST   LMOD(HWTHTTP).
  LIST   MOD(HWTHTTP).
  LIST   DDDEF(SIEALNKE).
/*
