       IDENTIFICATION DIVISION.
       FUNCTION-ID. ADDTWOF IS PROTOTYPE.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LK-A        PIC S9(9) COMP-5.
       01  LK-B        PIC S9(9) COMP-5.
       01  LK-RESULT   PIC S9(9) COMP-5.

       PROCEDURE DIVISION USING BY VALUE LK-A LK-B
                          RETURNING LK-RESULT.
       END FUNCTION ADDTWOF.
