      ******************************************************************
      *   CICS PLURALSIGHT 'EMPLOYEE APP ' - MAIN MENU.
      *      - LAYOUT FOR 'EMNUCTR' CONTAINER.
      *      - NON-PERSISTENT (NO ASSOCIATED FILE).
      *      - ONLY NEEDED TO MAKE THE MENU PSEUDO-CONVERSATIONAL AND
      *        CHANNEL-BASED IN ORDER TO FIT APP LINK/TRANSFER LOGIC!
      ******************************************************************
       01 MAIN-MENU-CONTAINER.
          05 MNU-USER-ID       PIC X(8).
