*--------------------------------------------------------------------7*
*                                                                     *
*---+----1----+----2----+----3----+----4----+----5----+----6----+----7*
         PCB    TYPE=DB,DBDNAME=IVPDB1,PROCOPT=G,KEYLEN=10
         SENSEG NAME=A1111111,PARENT=0
         PSBGEN LANG=ASSEM,PSBNAME=IVPPSB1
         END
