//ASMRUN    JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
//*   MY ASSEMBLY COMPILE & LINK + RUN JOB
//*
// EXPORT SYMLIST=(*)
// SET MYPRG='LAB503'
//*
//CL       EXEC ASMACL,
//             PARM.L=(MAP,LET,LIST),
//             MBR=&MYPRG
//*
//C.SYSIN    DD DISP=SHR,DSN=&SYSUID..ASM(&MYPRG)
//L.SYSLIB   DD DISP=SHR,DSN=&SYSUID..LOAD
//*
//GO       EXEC PGM=&MYPRG
//*
//STEPLIB    DD DISP=SHR,DSN=&SYSUID..LOAD
//SYSPRINT   DD SYSOUT=*
//
