//COBDB2J   JOB 1,NOTIFY=&SYSUID
//*
// EXPORT SYMLIST=(*)
// SET MYPRG='COBDB2'                            MY COBOL/DB2 PROGRAM
//*
//*   COMPILE, LINK & BIND
//*
//COMPILE  EXEC DB2CBL,MBR=&MYPRG
//COBOL.SYSLIB  DD DSN=&SYSUID..DCLGEN,DISP=SHR
//BIND.SYSTSIN  DD *,SYMBOLS=CNVTSYS
 DSN SYSTEM(DBDG)
 BIND PLAN(&SYSUID) PKLIST(&SYSUID..*) MEMBER(&MYPRG) -
      ACT(REP) ISO(CS) ENCODING(EBCDIC)
/*
//*
//*   RUN PROGRAM
//*
//         IF RC <= 4 THEN
//RUN      EXEC PGM=IKJEFT01
//STEPLIB    DD DSN=DSND10.SDSNLOAD,DISP=SHR
//REPORT     DD SYSOUT=*
//SYSTSIN    DD *,SYMBOLS=CNVTSYS
 DSN SYSTEM(DBDG)
 RUN PROGRAM(&MYPRG) PLAN(&SYSUID) LIB('&SYSUID..LOAD')
 END
/*
//SYSIN      DD DUMMY
//SYSUDUMP   DD DUMMY
//CEEDUMP    DD DUMMY
//SYSTSPRT   DD SYSOUT=*
//SYSPRINT   DD SYSOUT=*
/*
//         ENDIF
