//DFHCOBCL  JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
// EXPORT SYMLIST=(*)
// SET MEMBER='CICSCOB'
//*
//CICSPROG EXEC DFHZITCL
//COBOL.SYSIN  DD DISP=SHR,DSN=Z45864.CBL(&MEMBER.)
//*OBOL.SYSPRINT DD DUMMY
//LKED.SYSLMOD DD DISP=SHR,DSN=&SYSUID..CICS.PROD.DFHLOAD
//LKED.SYSIN DD *,SYMBOLS=EXECSYS
  NAME &MEMBER.(R)
/*
