//EAUDITJ   JOB 1,NOTIFY=&SYSUID
//*
//*   VSAM <ESDS> CREATION JOB FOR AUDIT TRAIL FILE (TWO COPIES)
//*
//SETLIB JCLLIB ORDER=&SYSUID..PROCLIB              MY PROCLIB
//*
//DEFINE1  EXEC EAUDGEN,SUFFIX='1'                  MY PROC (1ST RUN)
//DEFINE2  EXEC EAUDGEN,SUFFIX='2'                  MY PROC (2ND RUN)
//
