//IDCAMSL  JOB FB3,NOTIFY=&SYSUID
//*
//* UTILITY JCL FOR IDCAMS  -- LIST CATALOG INFROMATION.-
//*
//STEP1   EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *,SYMBOLS=CNVTSYS
  LISTCAT ENTRY(&SYSUID..KSDS.EMPMAST) ALL
  LISTCAT ENTRY(&SYSUID..ESDS.EAUDIT1) ALL
  LISTCAT ENTRY(&SYSUID..RRDS.ESONRUL) ALL

  LISTCAT ENTRY(DFSF10.DFSIVD1)        ALL
  LISTCAT ENTRY(DFSF10.DFSIVD1I)       ALL
/*
