//IDCAMSP  JOB FB3,NOTIFY=&SYSUID
//*
//* UTILITY JCL FOR IDCAMS  -- PRINT VSAM FILE CONTENTS.-
//*
//STEP1   EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *,SYMBOLS=CNVTSYS
  PRINT INDATASET(&SYSUID..VSAM)  CHARACTER
  PRINT INDATASET(DFSF10.DFSIVD1) CHARACTER
/*
