//IDCAMSP  JOB FB3,NOTIFY=&SYSUID
//*
//* UTILITY JCL FOR IDCAMS  -- PRINT VSAM FILE CONTENTS.-
//*
//STEP1   EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *,SYMBOLS=CNVTSYS
  PRINT INDATASET(Z45864.ESDS.EAUDIT1) CHARACTER
/*
