//SQLINTBL JOB 1,NOTIFY=&SYSUID
//SQLEXEC  EXEC DB2JCL
//SYSIN    DD *,SYMBOLS=CNVTSYS
  SET CURRENT SCHEMA &SYSUID.;

  INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, SALARY)
                VALUES ('John', 'Doe', 75000);

  INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, SALARY)
                VALUES ('Jane', 'Smith', 65000);

  COMMIT;
/*
