* ---------------------------------------------------------------------
*  CICS PLURALSIGHT 'EMPLOYEE APP'.
*    - LIST EMPLOYEES MAPSET 'ELSTMAP'.
*    - CONTAINS TWO MAPS:
*        1. 'ELSTM' -> EMPLOYEE LIST MAP.
*        2. 'EFILM' -> FILTERS MAP.
* ---------------------------------------------------------------------
* ---------------------------------------------------------------------
*  GLOBAL SETTINGS.
* ---------------------------------------------------------------------
ELSTMAP  DFHMSD MODE=INOUT,                                            X
               CTRL=(FREEKB,FRSET),                                    X
               CURSLOC=YES,                                            X
               DSATTS=COLOR,                                           X
               MAPATTS=(COLOR,HILIGHT),                                X
               STORAGE=AUTO,                                           X
               LANG=COBOL,                                             X
               TIOAPFX=YES,                                            X
               TYPE=&SYSPARM
* ---------------------------------------------------------------------
*  1. LIST EMPLOYEES MAP.
* ---------------------------------------------------------------------
ELSTM    DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
*
*  HEADING SECTION.
*
TRANID   DFHMDF POS=(1,1),LENGTH=4,ATTRB=(ASKIP,NORM)
         DFHMDF POS=(1,33),LENGTH=13,ATTRB=(ASKIP,NORM),               X
               INITIAL='Employee List'
         DFHMDF POS=(1,69),LENGTH=4,ATTRB=(ASKIP,NORM),                X
               INITIAL='Page'
PAGEN    DFHMDF POS=(1,74),ATTRB=(ASKIP,NORM),PICOUT='ZZZZZ9'
*
*  FILTER SECTION.
*
         DFHMDF POS=(3,1),LENGTH=9, ATTRB=(ASKIP,NORM),                X
               INITIAL='Filters: '
FLTRS    DFHMDF POS=(3,11),LENGTH=69,ATTRB=(ASKIP,NORM)
*
*  COLUMN HEADINGS.
*
         DFHMDF POS=(5,1),LENGTH=39,ATTRB=(ASKIP,BRT),                 X
               INITIAL='  Emp Id   Primary Name                 '
         DFHMDF POS=(5,41),LENGTH=39,ATTRB=(ASKIP,BRT),                X
               INITIAL=' Job Title                     Dept Id'
*
*  DETAIL SECTION.
*
*  ----- LINE 01 -----
SELCT01  DFHMDF POS=(6,1),LENGTH=1,ATTRB=(UNPROT,IC),HILIGHT=UNDERLINE
EMPID01  DFHMDF POS=(6,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM01  DFHMDF POS=(6,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL01  DFHMDF POS=(6,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID01  DFHMDF POS=(6,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 02 -----
SELCT02  DFHMDF POS=(7,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID02  DFHMDF POS=(7,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM02  DFHMDF POS=(7,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL02  DFHMDF POS=(7,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID02  DFHMDF POS=(7,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 03 -----
SELCT03  DFHMDF POS=(8,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID03  DFHMDF POS=(8,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM03  DFHMDF POS=(8,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL03  DFHMDF POS=(8,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID03  DFHMDF POS=(8,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 04 -----
SELCT04  DFHMDF POS=(9,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID04  DFHMDF POS=(9,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM04  DFHMDF POS=(9,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL04  DFHMDF POS=(9,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID04  DFHMDF POS=(9,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 05 -----
SELCT05  DFHMDF POS=(10,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID05  DFHMDF POS=(10,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM05  DFHMDF POS=(10,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL05  DFHMDF POS=(10,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID05  DFHMDF POS=(10,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 06 -----
SELCT06  DFHMDF POS=(11,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID06  DFHMDF POS=(11,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM06  DFHMDF POS=(11,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL06  DFHMDF POS=(11,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID06  DFHMDF POS=(11,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 07 -----
SELCT07  DFHMDF POS=(12,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID07  DFHMDF POS=(12,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM07  DFHMDF POS=(12,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL07  DFHMDF POS=(12,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID07  DFHMDF POS=(12,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 08 -----
SELCT08  DFHMDF POS=(13,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID08  DFHMDF POS=(13,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM08  DFHMDF POS=(13,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL08  DFHMDF POS=(13,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID08  DFHMDF POS=(13,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 09 -----
SELCT09  DFHMDF POS=(14,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID09  DFHMDF POS=(14,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM09  DFHMDF POS=(14,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL09  DFHMDF POS=(14,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID09  DFHMDF POS=(14,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 10 -----
SELCT10  DFHMDF POS=(15,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID10  DFHMDF POS=(15,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM10  DFHMDF POS=(15,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL10  DFHMDF POS=(15,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID10  DFHMDF POS=(15,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 11 -----
SELCT11  DFHMDF POS=(16,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID11  DFHMDF POS=(16,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM11  DFHMDF POS=(16,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL11  DFHMDF POS=(16,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID11  DFHMDF POS=(16,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 12 -----
SELCT12  DFHMDF POS=(17,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID12  DFHMDF POS=(17,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM12  DFHMDF POS=(17,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL12  DFHMDF POS=(17,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID12  DFHMDF POS=(17,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 13 -----
SELCT13  DFHMDF POS=(18,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID13  DFHMDF POS=(18,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM13  DFHMDF POS=(18,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL13  DFHMDF POS=(18,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID13  DFHMDF POS=(18,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 14 -----
SELCT14  DFHMDF POS=(19,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID14  DFHMDF POS=(19,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM14  DFHMDF POS=(19,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL14  DFHMDF POS=(19,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID14  DFHMDF POS=(19,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 15 -----
SELCT15  DFHMDF POS=(20,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID15  DFHMDF POS=(20,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM15  DFHMDF POS=(20,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL15  DFHMDF POS=(20,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID15  DFHMDF POS=(20,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*  ----- LINE 16 -----
SELCT16  DFHMDF POS=(21,1),LENGTH=1,ATTRB=(UNPROT),HILIGHT=UNDERLINE
EMPID16  DFHMDF POS=(21,3),LENGTH=8,ATTRB=(ASKIP,NORM)
PRMNM16  DFHMDF POS=(21,12),LENGTH=29,ATTRB=(ASKIP,NORM)
JOBTL16  DFHMDF POS=(21,42),LENGTH=29,ATTRB=(ASKIP,NORM)
DPTID16  DFHMDF POS=(21,72),LENGTH=8,ATTRB=(ASKIP,NORM)
*
*  MESSAGE SECTION.
*
MESS     DFHMDF POS=(23,1),LENGTH=79,ATTRB=(ASKIP,NORM)
*
*  AID KEY SECTION.
*
         DFHMDF POS=(24,1),LENGTH=27,ATTRB=(ASKIP,NORM),               X
               INITIAL='ENTER Details  PF3 Filters '
HLPPF7   DFHMDF POS=(24,29),LENGTH=9,ATTRB=(ASKIP,NORM),               X
               INITIAL='PF7 Prev '
HLPPF8   DFHMDF POS=(24,39),LENGTH=9,ATTRB=(ASKIP,NORM),               X
               INITIAL='PF8 Next '
         DFHMDF POS=(24,49),LENGTH=26,ATTRB=(ASKIP,NORM),              X
               INITIAL='PF10 Sign Off  PF12 Cancel'
* ---------------------------------------------------------------------
*  2. FILTERS MAP.
* ---------------------------------------------------------------------
EFILM    DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
*
*  HEADING SECTION.
*
TRANFL   DFHMDF POS=(1,1),LENGTH=4,ATTRB=(ASKIP,BRT),COLOR=TURQUOISE
         DFHMDF POS=(1,31),LENGTH=18,ATTRB=(ASKIP,BRT),                X
               INITIAL='Enter/Edit Filters',COLOR=TURQUOISE
*
*  SELECT/ORDER SECTION.
*
         DFHMDF POS=(3,1),LENGTH=15,ATTRB=(ASKIP,BRT),COLOR=TURQUOISE, X
               INITIAL='Select/Order By'
KEYSEL   DFHMDF POS=(3,17),LENGTH=1,ATTRB=(UNPROT,BRT,IC),             X
               INITIAL='1',HILIGHT=UNDERLINE,COLOR=YELLOW
         DFHMDF POS=(3,19),LENGTH=25,ATTRB=(ASKIP,NORM),               X
               INITIAL='1 Employee Id    Matching'
MATCH    DFHMDF POS=(3,45),LENGTH=30,ATTRB=(UNPROT,BRT),COLOR=YELLOW,  X
               HILIGHT=UNDERLINE
         DFHMDF POS=(3,76),LENGTH=0
         DFHMDF POS=(4,19),LENGTH=15,ATTRB=(ASKIP,NORM),               X
               INITIAL='2 Employee Name'
*
*  FILTERS SECTION.
*
         DFHMDF POS=(6,1),LENGTH=7,ATTRB=(ASKIP,NORM),                 X
               INITIAL='Filters'
*
         DFHMDF POS=(8,8),LENGTH=25,ATTRB=(ASKIP,NORM),                X
               INITIAL='Department Id     Include'
DPTINCL  DFHMDF POS=(8,34),LENGTH=8,ATTRB=(UNPROT,BRT),OCCURS=4,       X
               HILIGHT=UNDERLINE,COLOR=YELLOW
         DFHMDF POS=(8,70),LENGTH=0
*
         DFHMDF POS=(9,26),LENGTH=7,ATTRB=(ASKIP,NORM),                X
               INITIAL='Exclude'
DPTEXCL  DFHMDF POS=(9,34),LENGTH=8,ATTRB=(UNPROT,BRT),OCCURS=4,       X
               HILIGHT=UNDERLINE,COLOR=YELLOW
         DFHMDF POS=(9,70),LENGTH=0
*
         DFHMDF POS=(10,8),LENGTH=34,ATTRB=(ASKIP,NORM),               X
               INITIAL='Employment Date (YYYYMMDD)   After'
EDATEA   DFHMDF POS=(10,43),LENGTH=8,ATTRB=(UNPROT,BRT),               X
               HILIGHT=UNDERLINE,COLOR=YELLOW
*
         DFHMDF POS=(10,52),LENGTH=8,ATTRB=(ASKIP,NORM),               X
               INITIAL='  Before'
EDATEB   DFHMDF POS=(10,61),LENGTH=8,ATTRB=(UNPROT,BRT),               X
               HILIGHT=UNDERLINE,COLOR=YELLOW
         DFHMDF POS=(10,70),LENGTH=0
*
*  MESSAGE SECTION.
*
MESSFL   DFHMDF POS=(23,1),LENGTH=79,ATTRB=(ASKIP,BRT)
*
*  AID KEY SECTION.
*
         DFHMDF POS=(24,1),LENGTH=63,ATTRB=(ASKIP,NORM),               X
               INITIAL='ENTER Display List  PF3 Exit  PF10 Sign Off  PFX
               12 Clear Filters'
* ---------------------------------------------------------------------
*  ENDING SECTION.
* ---------------------------------------------------------------------
         DFHMSD TYPE=FINAL
         END
