
       COPY ADDTWOF.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTUDF.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION ADDTWOF.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT    PIC S9(9) COMP-5.

       PROCEDURE DIVISION.
           COMPUTE WS-RESULT = FUNCTION ADDTWOF(10 25)
           DISPLAY 'RESULT = ' WS-RESULT
           GOBACK.
       END PROGRAM TESTUDF.
