*---------------------------------------------------------------------*
*               GENERAL PURPOSE 80-CHARACTER INPUT GETTER
*---------------------------------------------------------------------*
*---------------------------------------------------------------------*
*                                                                     *
*---+----1----+----2----+----3----+----4----+----5----+----6----+----7*
GET1     CSECT
*---------------------------------------------------------------------*
R1       EQU   1
R2       EQU   2
R3       EQU   3
R6       EQU   6
R12      EQU   12
R13      EQU   13
R15      EQU   15
*---------------------------------------------------------------------*
         SAVE  (14,12)            Enter
         LR    R12,R15            Set up addressing
         USING GET1,R12
*---------------------------------------------------------------------*
         LA    R2,SAVEAREA        Chain save areas
         ST    R2,8(,R13)
         ST    R13,4(,R2)
         LR    R13,R2
         LR    R6,R1              Save before open
*---------------------------------------------------------------------*
         TM    SAMIN+48,X'10'
         BO    OPENOK
         OPEN  (SAMIN)            Open input to the same SAM-E file
*---------------------------------------------------------------------*
OPENOK   DS    0H
         GET   SAMIN,(R6)         Get next record
*---------------------------------------------------------------------*
RETURN   DS    0H
         L     R13,4(,R13)        Get old save area
         RETURN (14,12),RC=0
*---------------------------------------------------------------------*
ENDFILE  DS    0H
         L     R13,4(,R13)        Get old save area
         RETURN (14,12),RC=255
*---------------------------------------------------------------------*
SAVEAREA DC    18F'0'
         DC    C'READ ROUTINES - COURSE K3600'
*---------------------------------------------------------------------*
SAMIN    DCB   DSORG=PS,MACRF=GM,DDNAME=SYSIN,RECFM=FB,LRECL=80,       X
               EODAD=ENDFILE
*---------------------------------------------------------------------*
         END
