//IDCAMSLJ  JOB FB3,NOTIFY=&SYSUID
//*
//*   UTILITY JCL FOR IDCAMS  -- LIST CATALOG INFROMATION.-
//*
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT   DD SYSOUT=*
//SYSIN      DD *,SYMBOLS=CNVTSYS
  LISTCAT ENTRY(&SYSUID..IMS.SKILL) ALL
/*
