//MYDBDGEN  JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
//*   MY IMS DBDGEN JOB
//*
//SETLIB   JCLLIB ORDER=DFSF10.PROCLIB
//*
// EXPORT SYMLIST=(*)
// SET MYDBD='SKILL9'
//*
//STEP1    EXEC DBDGEN,MBR=&MYDBD
//*
//C.SYSIN    DD DISP=SHR,DSN=&SYSUID..IMS.DBDSRC(&MYDBD)
//L.SYSLMOD  DD DISP=SHR,DSN=&SYSUID..IMS.DBDLIB(&MYDBD)
//
