//MYIMSPLI  JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
//*   MY IMS PL/I + DL/I COMPILE & LINK JOB
//*
//SETLIB   JCLLIB ORDER=&SYSUID..IMS.PROCLIB
//*
// EXPORT SYMLIST=(*)
// SET MYPRG='PLITMLAB'               IMS DB PL/I PROGRAM
//*
//STEP1    EXEC IMSPLI,MBR=&MYPRG
//*
//C.SYSIN    DD  DISP=SHR,DSN=&SYSUID..IMS.PLISRC(&MYPRG)
//L.SYSLMOD  DD  DISP=SHR,DSN=&SYSUID..IMS.PGMLIB(&MYPRG)
//*
//L.SYSIN    DD *,SYMBOLS=CNVTSYS
  INCLUDE SYSLIB(DFSLI000)
     NAME &MYPRG(R)
/*
