//MYIMSCOB  JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
//*   MY IMS COBOL DL/I COMPILE & LINK JOB
//*
//SETLIB   JCLLIB ORDER=&SYSUID..IMS.PROCLIB
//*
// EXPORT SYMLIST=(*)
// SET MYPRG='IMSLABS1'               IMS DB LABS PROGRAM
//*
//STEP1    EXEC IMSCOBOL,MBR=&MYPRG
//*
//C.SYSIN    DD  DISP=SHR,DSN=&SYSUID..IMS.PGMSRC(&MYPRG)
//L.SYSLMOD  DD  DISP=SHR,DSN=&SYSUID..IMS.PGMLIB(&MYPRG)
//*
//L.SYSIN    DD *,SYMBOLS=CNVTSYS
  INCLUDE SYSLIB(DFSLI000)
    ENTRY DLITCBL
     NAME &MYPRG(R)
/*
