//MYMFSGEN  JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
//*   MY IMS MFSGEN JOB
//*
//SETLIB   JCLLIB ORDER=DFSF10.PROCLIB
//*
// EXPORT SYMLIST=(*)
// SET MYFMT='TM'
//*
//STEP1    EXEC MFSUTL,MBR=&MYFMT
//*
//S1.SYSIN   DD DISP=SHR,DSN=&SYSUID..IMS.MFSSRC(&MYFMT)
//*
//S1.REFIN   DD DISP=OLD,DSN=&SYSUID..IMS.REFERAL
//S1.REFOUT  DD DISP=OLD,DSN=&SYSUID..IMS.REFERAL
//S1.REFRD   DD DISP=OLD,DSN=&SYSUID..IMS.REFERAL
//*
//S2.FORMAT  DD DISP=SHR,DSN=&SYSUID..IMS.FORMAT
//
