//MYPSBGEN  JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
//*   MY IMS PSBGEN JOB
//*
//SETLIB   JCLLIB ORDER=DFSF10.PROCLIB
//*
// EXPORT SYMLIST=(*)
// SET MYPSB='PSB1PLI'
//*
//STEP1    EXEC PSBGEN,MBR=&MYPSB
//*
//C.SYSIN    DD DISP=SHR,DSN=&SYSUID..IMS.PSBSRC(&MYPSB)
//L.SYSLMOD  DD DISP=SHR,DSN=&SYSUID..IMS.PSBLIB(&MYPSB)
//*
