//MYSPOCK1  JOB FB3,,REGION=0M,NOTIFY=&SYSUID
//*
//*   MY IMS SINGLE POINT OF CONTROL (MR. SPOCK) JOB
//*
//SPOCK1   EXEC PGM=CSLUSPOC,PARM=('IMSPLEX=PLEX1,ROUTE=IVP1')
//STEPLIB    DD DISP=SHR,DSN=DFSF10.SDFSRESL
//SYSPRINT   DD SYSOUT=*
//SYSIN      DD *
  QUERY MEMBER TYPE(IMS) SHOW(ALL)
  QUERY TRAN NAME(IVTNO) SHOW(ALL)
  QUERY DB NAME(IVPDB1) SHOW(ALL)
/*
